experiments/results/membership_1tb_260912/bitmap_load.txt
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       24 bytes each (+ 0 bytes user-defined timestamp)
Values:     1000 bytes each (500 bytes after compression)
Entries:    1048576000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    1024000.0 MB (estimated)
FileSize:   524000.0 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: VectorRepFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/work/vcomp/exp/membership_1tb/bitmap]
fillvirtual  : 55695394.000 micros/op 0 ops/sec 55.695 seconds 1 operations; 13841.8 MB/s fillvirtual done
flush memtable
compact0 found 0 files to compact
waitforcompaction(/work/vcomp/exp/membership_1tb/bitmap): started
waitforcompaction(/work/vcomp/exp/membership_1tb/bitmap): finished with status (OK)


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L1      3/0    243.03 MB   0.9      0.0     0.0      0.0       0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L2     46/0      2.50 GB   1.0      0.0     0.0      0.0       0.0       0.0      0.0     226.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L3    441/0     24.97 GB   1.0      0.0     0.0      0.0       0.0       0.0      0.0      16.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L4   3997/0    249.82 GB   1.0      0.0     0.0      0.0       0.0       0.0      0.0      70.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L5   8687/0    487.30 GB   0.2      0.0     0.0      0.0       0.0       0.0      0.0     383.4   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum  13174/0    764.83 GB   0.0      0.0     0.0      0.0       0.0       0.0      0.0     696.9   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Int      0/0      0.00 KB   0.0      0.0     0.0      0.0       0.0       0.0      0.0     591.1   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) WPreComp(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 60.7 total, 56.7 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 3135, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 6085, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 14, pending-compaction-bytes-stops: 430, total-delays: 6099, total-stops: 430
interval: 5322 total count
Block cache AutoHyperClockCache@0x7f7cb4051fd0#2380361 capacity: 32.00 MB seed: 12345678 usage: 4.00 KB table_size: 64 occupancy: 1 collections: 1 last_copies: 1 last_secs: 2.4e-05 secs_since: 60
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 60.7 total, 56.7 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0


Level Files Size(MB)
--------------------
  0        0        0
  1        3      243
  2       46     2555
  3      441    25571
  4     3997   255816
  5     8687   498999
  6        0        0

STATISTICS:
rocksdb.block.cache.miss COUNT : 0
rocksdb.block.cache.hit COUNT : 0
rocksdb.block.cache.add COUNT : 0
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.data.miss COUNT : 0
rocksdb.block.cache.data.hit COUNT : 0
rocksdb.block.cache.data.add COUNT : 0
rocksdb.block.cache.data.bytes.insert COUNT : 0
rocksdb.block.cache.bytes.read COUNT : 0
rocksdb.block.cache.bytes.write COUNT : 0
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 0
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 0
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.secondary.cache.hits COUNT : 0
rocksdb.secondary.cache.filter.hits COUNT : 0
rocksdb.secondary.cache.index.hits COUNT : 0
rocksdb.secondary.cache.data.hits COUNT : 0
rocksdb.compressed.secondary.cache.dummy.hits COUNT : 0
rocksdb.compressed.secondary.cache.hits COUNT : 0
rocksdb.compressed.secondary.cache.promotions COUNT : 0
rocksdb.compressed.secondary.cache.promotion.skips COUNT : 0
rocksdb.bloom.filter.useful COUNT : 0
rocksdb.bloom.filter.full.positive COUNT : 0
rocksdb.bloom.filter.full.true.positive COUNT : 0
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.bloom.filter.prefix.true.positive COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 0
rocksdb.memtable.miss COUNT : 0
rocksdb.l0.hit COUNT : 0
rocksdb.l1.hit COUNT : 0
rocksdb.l2andup.hit COUNT : 0
rocksdb.compaction.key.drop.new COUNT : 0
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 0
rocksdb.number.keys.read COUNT : 0
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 0
rocksdb.bytes.read COUNT : 0
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.no.file.opens COUNT : 0
rocksdb.no.file.errors COUNT : 0
rocksdb.stall.micros COUNT : 0
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 0
rocksdb.write.self COUNT : 0
rocksdb.write.other COUNT : 0
rocksdb.write.wal COUNT : 0
rocksdb.compact.read.bytes COUNT : 0
rocksdb.compact.write.bytes COUNT : 0
rocksdb.flush.write.bytes COUNT : 0
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 0
rocksdb.number.superversion_releases COUNT : 0
rocksdb.number.superversion_cleanups COUNT : 0
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.bytes.compressed.from COUNT : 0
rocksdb.bytes.compressed.to COUNT : 0
rocksdb.bytes.compression_bypassed COUNT : 815292342236
rocksdb.bytes.compression.rejected COUNT : 0
rocksdb.number.block_compression_bypassed COUNT : 197364191
rocksdb.number.block_compression_rejected COUNT : 0
rocksdb.bytes.decompressed.from COUNT : 0
rocksdb.bytes.decompressed.to COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.compaction.total.time.cpu_micros COUNT : 0
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.blobdb.cache.miss COUNT : 0
rocksdb.blobdb.cache.hit COUNT : 0
rocksdb.blobdb.cache.add COUNT : 0
rocksdb.blobdb.cache.add.failures COUNT : 0
rocksdb.blobdb.cache.bytes.read COUNT : 0
rocksdb.blobdb.cache.bytes.write COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.marked.trash.deleted COUNT : 0
rocksdb.files.deleted.immediately COUNT : 0
rocksdb.error.handler.bg.error.count COUNT : 0
rocksdb.error.handler.bg.io.error.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.error.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.memtable.payload.bytes.at.flush COUNT : 0
rocksdb.memtable.garbage.bytes.at.flush COUNT : 0
rocksdb.verify_checksum.read.bytes COUNT : 0
rocksdb.backup.read.bytes COUNT : 0
rocksdb.backup.write.bytes COUNT : 0
rocksdb.remote.compact.read.bytes COUNT : 0
rocksdb.remote.compact.write.bytes COUNT : 0
rocksdb.remote.compact.resumed.bytes COUNT : 0
rocksdb.hot.file.read.bytes COUNT : 0
rocksdb.warm.file.read.bytes COUNT : 0
rocksdb.cool.file.read.bytes COUNT : 0
rocksdb.cold.file.read.bytes COUNT : 0
rocksdb.ice.file.read.bytes COUNT : 0
rocksdb.hot.file.read.count COUNT : 0
rocksdb.warm.file.read.count COUNT : 0
rocksdb.cool.file.read.count COUNT : 0
rocksdb.cold.file.read.count COUNT : 0
rocksdb.ice.file.read.count COUNT : 0
rocksdb.last.level.read.bytes COUNT : 0
rocksdb.last.level.read.count COUNT : 0
rocksdb.non.last.level.read.bytes COUNT : 0
rocksdb.non.last.level.read.count COUNT : 0
rocksdb.last.level.seek.filtered COUNT : 0
rocksdb.last.level.seek.filter.match COUNT : 0
rocksdb.last.level.seek.data COUNT : 0
rocksdb.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.non.last.level.seek.filtered COUNT : 0
rocksdb.non.last.level.seek.filter.match COUNT : 0
rocksdb.non.last.level.seek.data COUNT : 0
rocksdb.non.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.non.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.block.checksum.compute.count COUNT : 39522
rocksdb.block.checksum.mismatch.count COUNT : 0
rocksdb.multiget.coroutine.count COUNT : 0
rocksdb.read.async.micros COUNT : 0
rocksdb.async.read.error.count COUNT : 0
rocksdb.table.open.prefetch.tail.miss COUNT : 6831
rocksdb.table.open.prefetch.tail.hit COUNT : 59039
rocksdb.timestamp.filter.table.checked COUNT : 0
rocksdb.timestamp.filter.table.filtered COUNT : 0
rocksdb.readahead.trimmed COUNT : 0
rocksdb.fifo.max.size.compactions COUNT : 0
rocksdb.fifo.ttl.compactions COUNT : 0
rocksdb.fifo.change_temperature.compactions COUNT : 0
rocksdb.prefetch.bytes COUNT : 0
rocksdb.prefetch.bytes.useful COUNT : 0
rocksdb.prefetch.hits COUNT : 0
rocksdb.footer.corruption.count COUNT : 0
rocksdb.file.read.corruption.retry.count COUNT : 0
rocksdb.file.read.corruption.retry.success.count COUNT : 0
rocksdb.number.wbwi.ingest COUNT : 0
rocksdb.sst.user.defined.index.load.fail.count COUNT : 0
rocksdb.db.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.times.cpu_micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.outfile.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 80.821703 P95 : 116.481481 P99 : 159.651852 P100 : 1415.000000 COUNT : 7285 SUM : 583766
rocksdb.table.open.io.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.get.micros P50 : 51.080788 P95 : 1055.126316 P99 : 1742.567164 P100 : 3375.000000 COUNT : 26348 SUM : 4786224
rocksdb.write.raw.block.micros P50 : 0.505456 P95 : 0.960366 P99 : 1.136263 P100 : 94363.000000 COUNT : 197416887 SUM : 721096381
rocksdb.numfiles.in.singlecompaction P50 : 3.235487 P95 : 8.434312 P99 : 36.218696 P100 : 56.000000 COUNT : 52991 SUM : 233274
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.flush.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.open.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.iterator.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.db.checksum.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.file.checksums.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.write.micros P50 : 0.501206 P95 : 0.952291 P99 : 0.992388 P100 : 94361.000000 COUNT : 394846948 SUM : 627401936
rocksdb.file.write.flush.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.write.compaction.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.write.db.open.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.write P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiget.io.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.level.read.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.async.read.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.poll.wait.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compaction.prefetch.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.prefetched.bytes.discarded P50 : 219196.050776 P95 : 365997.844828 P99 : 377354.741379 P100 : 414251.000000 COUNT : 13174 SUM : 2319403034
rocksdb.async.prefetch.abort.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.open.prefetch.tail.read.bytes P50 : 436474.981329 P95 : 528384.000000 P99 : 528384.000000 P100 : 528384.000000 COUNT : 13174 SUM : 5058932736
rocksdb.num.op.per.transaction P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiscan.op.prepare.iterators.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0

RocksDB:    version 10.10.1
Date:       Sat Sep 12 04:32:49 2026
CPU:        48 * Intel(R) Xeon(R) Gold 6336Y CPU @ 2.40GHz
CPUCache:   36864 KB
FillVirtual: exact membership on, key domain 1048576000, bitmap 125 MiB
  SST size calibration: entries=4096 stride=1 actual_bytes=4262532 estimated_bytes=4264065
  SST size calibration: entries=8192 stride=1 actual_bytes=8522356 estimated_bytes=8527467
  SST size calibration: entries=4096 stride=16000 actual_bytes=4264065 estimated_bytes=4264065
  SST size calibration: entries=8192 stride=16000 actual_bytes=8527467 estimated_bytes=8527467
SST size calibration: 0.045045 sec (memory-only)
SST size model: calibrated logical_entry_bytes=1024 target_bytes=67108864 entries_at_target=64473
FillVirtual: generating 1048576000 keys...
LogAndApply timing: off
Sort detail timing: off
Phase 1 shards: 8
FillVirtual: parallel synthetic Phase 1 enabled (shards=8, batches=16000)
  Phase 1 breakdown: keygen=51.635s sort=16.663s plr_fit=4.766s mutex=0.000s regbuild=0.003s addfile=0.063s register=0.067s
  Phase 1 keygen detail: foreground=13.634s accounted=73.197s rng_push_loop=51.635s
  Phase 1 register breakdown: calls=63 files=9098 batches=728 max_batch=24 total=0.067s mutex_wait=0.064s log_apply=0.000s install_schedule=0.000s cleanup=0.000s other=0.002s avg=1.058ms
  LogAndApply breakdown (phase1): calls=0 groups=0 writers=0 edits=0 avg_writers/group=0.00 total=0.000s avg=0.000ms
    pre: writer_wait=0.000s pre_cb=0.000s group_build=0.000s save_to=0.000s
    group_build_detail: find_version=0.000s new_version=0.000s apply_edit=0.000s push=0.000s other=0.000s
    save_to_detail: builder=0.000s changed_levels=0.000s mark_rebuild=0.000s other=0.000s
    save_to_builder_detail: consistency_base=0.000s consistency_new=0.000s sst_files=0.000s blob_files=0.000s cursors=0.000s consistency_final=0.000s other=0.000s
    manifest: total=0.000s load_table=0.000s new_manifest=0.000s prepare=0.000s encode=0.000s add_record=0.000s sync=0.000s set_current=0.000s log_flush=0.000s mutex_reacquire=0.000s other=0.000s
    prepare_detail: compaction_pri=0.000s file_index=0.000s bottommost=0.000s bottommost_skipped=0 other=0.000s
    file_index_detail: indexer=0.000s level_brief=0.000s l0_non_overlap=0.000s file_location=0.000s
    post: wal=0.000s install_version=0.000s append_compaction_score=0.000s callbacks=0.000s other=0.000s
  Flushes: 16000 (avg 65534 keys/batch, 5459885 segments total)
  Intra-batch dedup: 1048576000 -> 1048543390 keys (0.00% removed)
Phase 1 (flush + bg compaction started): 13.634 sec

FillVirtual: waiting for background compactions...
  L0 visible window: queued=16000 registered=16000 consumed=15998 pending=0 visible=2 batches=1281 max_batch=24 max_batch_mb=1561.29 max_pending=6902 target_mb=1600.00
  L0 visible window breakdown: refill=2.667s log_apply=2.584s install_schedule=0.062s cleanup=0.001s pending_mb=0.00 visible_mb=130.11
FillVirtual: draining residual L0...
  L0 drain done: 0.036 sec
  L0 visible window final: queued=16000 registered=16000 consumed=16000 pending=0 visible=0 batches=1281 refill=2.667s log_apply=2.584s
  Background compactions done: 19.346 sec
  BG virtual compaction breakdown: jobs=48379 inputs=221794 outputs=218969 total=530.596s gather=0.143s merge=32.320s split=17.515s mutex_wait=102.009s edit_build=0.842s log_apply=294.542s avg=10.967ms
  BG virtual commit batching: batches=5998 jobs=52991 avg_batch=8.83 queue_wait=127.235s leader_log_apply=16.174s
  Virtual trivial moves: jobs=4612 files=11480 bytes=748285089197 total=35.548s log_apply=24.316s
  Version metadata breakdown: superversion_install=0.283s obsolete_collect=0.000s obsolete_purge=0.000s
  LogAndApply breakdown (bg_wait): calls=0 groups=0 writers=0 edits=0 avg_writers/group=0.00 total=0.000s avg=0.000ms
    pre: writer_wait=0.000s pre_cb=0.000s group_build=0.000s save_to=0.000s
    group_build_detail: find_version=0.000s new_version=0.000s apply_edit=0.000s push=0.000s other=0.000s
    save_to_detail: builder=0.000s changed_levels=0.000s mark_rebuild=0.000s other=0.000s
    save_to_builder_detail: consistency_base=0.000s consistency_new=0.000s sst_files=0.000s blob_files=0.000s cursors=0.000s consistency_final=0.000s other=0.000s
    manifest: total=0.000s load_table=0.000s new_manifest=0.000s prepare=0.000s encode=0.000s add_record=0.000s sync=0.000s set_current=0.000s log_flush=0.000s mutex_reacquire=0.000s other=0.000s
    prepare_detail: compaction_pri=0.000s file_index=0.000s bottommost=0.000s bottommost_skipped=0 other=0.000s
    file_index_detail: indexer=0.000s level_brief=0.000s l0_non_overlap=0.000s file_location=0.000s
    post: wal=0.000s install_version=0.000s append_compaction_score=0.000s callbacks=0.000s other=0.000s
  Virtual SSTs remaining in registry: 13175
  Deferred obsolete cleanup: 0.474 sec
FillVirtual: materializing to DB...
  Virtual SSTs: 13175 (L1:3, L2:46, L3:441, L4:3997, L5:8688)
  Phase 2 materialize workers: 48, level groups: 1
  Phase 2a (materialize + SST write): 21.975 sec
  SST size audit: level=1 descriptor_bytes=254915126 predicted_written_bytes=254915126 actual_bytes=254836124 actual_over_predicted_pct=-0.030991
  SST size audit: level=2 descriptor_bytes=2679873244 predicted_written_bytes=2679873244 actual_bytes=2679389203 actual_over_predicted_pct=-0.018062
  SST size audit: level=3 descriptor_bytes=26826334878 predicted_written_bytes=26826334878 actual_bytes=26812808797 actual_over_predicted_pct=-0.050421
  SST size audit: level=4 descriptor_bytes=268398025320 predicted_written_bytes=268398025320 actual_bytes=268242372464 actual_over_predicted_pct=-0.057993
  SST size audit: level=5 descriptor_bytes=525253773002 predicted_written_bytes=523541247410 actual_bytes=523238439755 actual_over_predicted_pct=-0.057838
  Phase 2 breakdown: sst_write=21.975s version_edit=0.090s
  LogAndApply breakdown (phase2): calls=0 groups=0 writers=0 edits=0 avg_writers/group=0.00 total=0.000s avg=0.000ms
    pre: writer_wait=0.000s pre_cb=0.000s group_build=0.000s save_to=0.000s
    group_build_detail: find_version=0.000s new_version=0.000s apply_edit=0.000s push=0.000s other=0.000s
    save_to_detail: builder=0.000s changed_levels=0.000s mark_rebuild=0.000s other=0.000s
    save_to_builder_detail: consistency_base=0.000s consistency_new=0.000s sst_files=0.000s blob_files=0.000s cursors=0.000s consistency_final=0.000s other=0.000s
    manifest: total=0.000s load_table=0.000s new_manifest=0.000s prepare=0.000s encode=0.000s add_record=0.000s sync=0.000s set_current=0.000s log_flush=0.000s mutex_reacquire=0.000s other=0.000s
    prepare_detail: compaction_pri=0.000s file_index=0.000s bottommost=0.000s bottommost_skipped=0 other=0.000s
    file_index_detail: indexer=0.000s level_brief=0.000s l0_non_overlap=0.000s file_location=0.000s
    post: wal=0.000s install_version=0.000s append_compaction_score=0.000s callbacks=0.000s other=0.000s
  LogAndApply breakdown (total): calls=0 groups=0 writers=0 edits=0 avg_writers/group=0.00 total=0.000s avg=0.000ms
    pre: writer_wait=0.000s pre_cb=0.000s group_build=0.000s save_to=0.000s
    group_build_detail: find_version=0.000s new_version=0.000s apply_edit=0.000s push=0.000s other=0.000s
    save_to_detail: builder=0.000s changed_levels=0.000s mark_rebuild=0.000s other=0.000s
    save_to_builder_detail: consistency_base=0.000s consistency_new=0.000s sst_files=0.000s blob_files=0.000s cursors=0.000s consistency_final=0.000s other=0.000s
    manifest: total=0.000s load_table=0.000s new_manifest=0.000s prepare=0.000s encode=0.000s add_record=0.000s sync=0.000s set_current=0.000s log_flush=0.000s mutex_reacquire=0.000s other=0.000s
    prepare_detail: compaction_pri=0.000s file_index=0.000s bottommost=0.000s bottommost_skipped=0 other=0.000s
    file_index_detail: indexer=0.000s level_brief=0.000s l0_non_overlap=0.000s file_location=0.000s
    post: wal=0.000s install_version=0.000s append_compaction_score=0.000s callbacks=0.000s other=0.000s
Phase 2 (materialization): 22.097 sec, 789427968 keys written
Total: 55.077 sec (phase1=13.634 + wait=19.346 + phase2=22.097)